---
kind: property
id: P:Autodesk.Revit.DB.SpatialElementTag.RotationAngle
source: html/b82d0c41-45b0-9fb8-8370-f481988fc19b.htm
---
# Autodesk.Revit.DB.SpatialElementTag.RotationAngle Property

The rotation angle of the tag relative to its view

## Syntax (C#)
```csharp
public double RotationAngle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: Angle can only be changed for Model orientation